[NoCoverage] BlockStatement
src/index.ts:30:49
 const app = fastify();
 
 // Declaração de Rotas da API
-app.post("/products", async (request, reply) => { 
-    await createProductController.handle(request, reply); 
-});
+app.post("/products", async (request, reply) => {});
 
 app.post("/product-orders", async (request, reply) => { 

[NoCoverage] StringLiteral
src/index.ts:30:10
 const app = fastify();
 
 // Declaração de Rotas da API
-app.post("/products", async (request, reply) => { 
+app.post("", async (request, reply) => { 
     await createProductController.handle(request, reply); 
 });

[NoCoverage] BlockStatement
src/index.ts:34:55
     await createProductController.handle(request, reply); 
 });
 
-app.post("/product-orders", async (request, reply) => { 
-    await createProductOrderController.handle(request, reply); 
-});
+app.post("/product-orders", async (request, reply) => {});
 
 app.listen({ port: 3000 }, (err, address) => {

[NoCoverage] StringLiteral
src/index.ts:34:10
     await createProductController.handle(request, reply); 
 });
 
-app.post("/product-orders", async (request, reply) => { 
+app.post("", async (request, reply) => { 
     await createProductOrderController.handle(request, reply); 
 });

[NoCoverage] BlockStatement
src/index.ts:38:46
     await createProductOrderController.handle(request, reply); 
 });
 
-app.listen({ port: 3000 }, (err, address) => {
-    if (err) {
-        console.error("Error starting server:", err);
-        process.exit(1);
-    }
-    console.log(`Server is running at ${address}`);
-});
+app.listen({ port: 3000 }, (err, address) => {});

[NoCoverage] ObjectLiteral
src/index.ts:38:12
     await createProductOrderController.handle(request, reply); 
 });
 
-app.listen({ port: 3000 }, (err, address) => {
+app.listen({}, (err, address) => {
     if (err) {
         console.error("Error starting server:", err);

[NoCoverage] ConditionalExpression
src/index.ts:39:9
 });
 
 app.listen({ port: 3000 }, (err, address) => {
-    if (err) {
+    if (false) {
         console.error("Error starting server:", err);
         process.exit(1);

[NoCoverage] BlockStatement
src/index.ts:39:14
 });
 
 app.listen({ port: 3000 }, (err, address) => {
-    if (err) {
-        console.error("Error starting server:", err);
-        process.exit(1);
-    }
+    if (err) {}
     console.log(`Server is running at ${address}`);
 });
