[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:14:47
 
     private sqliteConnection: SqliteConnection;
 
-    constructor(connection: SqliteConnection) {
-        this.sqliteConnection = connection;
-    }
+    constructor(connection: SqliteConnection) {}
 
     public create(productOrder: ProductOrder): void | InfrastructureError {
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Survived] BlockStatement
src/repositories/ProductOrderRepository.ts:18:75
         this.sqliteConnection = connection;
     }
 
-    public create(productOrder: ProductOrder): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const insertStatement = connection.prepare(
-                "INSERT INTO product_orders (id, product_barcode, order_quantity, order_date) VALUES (?, ?, ?, ?)"
-            );
-            insertStatement.run(
-                productOrder.getId(),
-                productOrder.getProduct().getBarcode(),
-                productOrder.getOrderQuantity(),
-                productOrder.formatOrderDate()
-            );
-        } catch (error) {
-            return new InfrastructureError("Failed to create product order");
-        }
-    }
+    public create(productOrder: ProductOrder): void | InfrastructureError {}
 }
 

[Survived] BlockStatement
src/repositories/ProductOrderRepository.ts:19:13
     }
 
     public create(productOrder: ProductOrder): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const insertStatement = connection.prepare(
-                "INSERT INTO product_orders (id, product_barcode, order_quantity, order_date) VALUES (?, ?, ?, ?)"
-            );
-            insertStatement.run(
-                productOrder.getId(),
-                productOrder.getProduct().getBarcode(),
-                productOrder.getOrderQuantity(),
-                productOrder.formatOrderDate()
-            );
-        } catch (error) {
+        try {} catch (error) {
             return new InfrastructureError("Failed to create product order");
         }

[Killed] StringLiteral
src/repositories/ProductOrderRepository.ts:22:17
         try {
             const connection: Database.Database = this.sqliteConnection.getConnection();
             const insertStatement = connection.prepare(
-                "INSERT INTO product_orders (id, product_barcode, order_quantity, order_date) VALUES (?, ?, ?, ?)"
+                ""
             );
             insertStatement.run(
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] BlockStatement
src/repositories/ProductOrderRepository.ts:30:25
                 productOrder.getOrderQuantity(),
                 productOrder.formatOrderDate()
             );
-        } catch (error) {
-            return new InfrastructureError("Failed to create product order");
-        }
+        } catch (error) {}
     }
 }

[NoCoverage] StringLiteral
src/repositories/ProductOrderRepository.ts:31:44
                 productOrder.formatOrderDate()
             );
         } catch (error) {
-            return new InfrastructureError("Failed to create product order");
+            return new InfrastructureError("");
         }
     }
