[Killed] BlockStatement
src/repositories/ProductRepository.ts:19:65
         this.sqliteConnection = connection;
     }
 
-    public create(product: Product): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const insertStatement = connection.prepare(
-                "INSERT INTO products (barcode, name, quantity_in_stock) VALUES (?, ?, ?)"
-            );
-            insertStatement.run(product.getBarcode(), product.getName(),
-                product.getQuantityInStock());
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
-    }
+    public create(product: Product): void | InfrastructureError {}
 
     public findByBarcode(barcode: string): Product | null | InfrastructureError {
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Product

Received value has no prototype
Received value: null

[Killed] BlockStatement
src/repositories/ProductRepository.ts:20:13
     }
 
     public create(product: Product): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const insertStatement = connection.prepare(
-                "INSERT INTO products (barcode, name, quantity_in_stock) VALUES (?, ?, ?)"
-            );
-            insertStatement.run(product.getBarcode(), product.getName(),
-                product.getQuantityInStock());
-        } catch (error) {
+        try {} catch (error) {
             return new InfrastructureError("Database error");
         }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Product

Received value has no prototype
Received value: null

[Killed] StringLiteral
src/repositories/ProductRepository.ts:23:17
         try {
             const connection: Database.Database = this.sqliteConnection.getConnection();
             const insertStatement = connection.prepare(
-                "INSERT INTO products (barcode, name, quantity_in_stock) VALUES (?, ?, ?)"
+                ""
             );
             insertStatement.run(product.getBarcode(), product.getName(),
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] BlockStatement
src/repositories/ProductRepository.ts:27:25
             );
             insertStatement.run(product.getBarcode(), product.getName(),
                 product.getQuantityInStock());
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
src/repositories/ProductRepository.ts:28:44
             insertStatement.run(product.getBarcode(), product.getName(),
                 product.getQuantityInStock());
         } catch (error) {
-            return new InfrastructureError("Database error");
+            return new InfrastructureError("");
         }
     }

[Killed] BlockStatement
src/repositories/ProductRepository.ts:32:81
         }
     }
 
-    public findByBarcode(barcode: string): Product | null | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const selectStatement = connection.prepare(
-                "SELECT * FROM products WHERE barcode = ?"
-            );
-            const row = selectStatement.get(barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
-            if (row) {
-                return Product.rebuild(row.barcode, row.name, row.quantity_in_stock);
-            } else {
-                return null;
-            }
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
-    }
+    public findByBarcode(barcode: string): Product | null | InfrastructureError {}
 }
 
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Product

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
src/repositories/ProductRepository.ts:33:13
     }
 
     public findByBarcode(barcode: string): Product | null | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const selectStatement = connection.prepare(
-                "SELECT * FROM products WHERE barcode = ?"
-            );
-            const row = selectStatement.get(barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
-            if (row) {
-                return Product.rebuild(row.barcode, row.name, row.quantity_in_stock);
-            } else {
-                return null;
-            }
-        } catch (error) {
+        try {} catch (error) {
             return new InfrastructureError("Database error");
         }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Product

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
src/repositories/ProductRepository.ts:39:17
                 "SELECT * FROM products WHERE barcode = ?"
             );
             const row = selectStatement.get(barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
-            if (row) {
+            if (false) {
                 return Product.rebuild(row.barcode, row.name, row.quantity_in_stock);
             } else {
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Product

Received value has no prototype
Received value: null

[Killed] BlockStatement
src/repositories/ProductRepository.ts:39:22
                 "SELECT * FROM products WHERE barcode = ?"
             );
             const row = selectStatement.get(barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
-            if (row) {
-                return Product.rebuild(row.barcode, row.name, row.quantity_in_stock);
-            } else {
+            if (row) {} else {
                 return null;
             }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Product

Received value has no prototype
Received value: undefined

[Survived] BlockStatement
src/repositories/ProductRepository.ts:41:20
             const row = selectStatement.get(barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
             if (row) {
                 return Product.rebuild(row.barcode, row.name, row.quantity_in_stock);
-            } else {
-                return null;
-            }
+            } else {}
         } catch (error) {
             return new InfrastructureError("Database error");

[Killed] BlockStatement
src/repositories/ProductRepository.ts:44:25
             } else {
                 return null;
             }
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
+        } catch (error) {}
     }
 }
killedBy: CreateProductOrder integration tests should return 500 if the connection with the database fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400
