[Killed] BlockStatement
src/controllers/CreateProductController.ts:9:70
 
     private createProductUseCase: CreateProductUsecaseInterface;
 
-    constructor(createProductUseCase: CreateProductUsecaseInterface) {
-        this.createProductUseCase = createProductUseCase;
-    }
+    constructor(createProductUseCase: CreateProductUsecaseInterface) {}
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
killedBy: Testing CreateProductController should create a product successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'execute')

[Killed] BlockStatement
src/controllers/CreateProductController.ts:13:79
         this.createProductUseCase = createProductUseCase;
     }
 
-    async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-        if(request.body === undefined || typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
-            return;
-        }
-        const { barcode, name } = request.body as { barcode: string, name: string };
-
-        const result = this.createProductUseCase.execute(barcode, name);
-
-        if (result instanceof InfrastructureError) {
-            reply.status(500).send({ error: result.message });
-            return;
-        }
-        
-        if (result instanceof Error) {
-            reply.status(400).send({ error: result.message });
-            return;
-        }
-
-        reply.status(201).send({ 
-            barcode: result.barcode, 
-            name: result.name, 
-            quantityInStock: result.quantityInStock 
-        });
-    }
+    async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {}
 
 }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 0

[Killed] EqualityOperator
src/controllers/CreateProductController.ts:14:42
     }
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-        if(request.body === undefined || typeof request.body !== "object") {
+        if(request.body === undefined || typeof request.body === "object") {
             reply.status(400).send({ error: "Invalid request body" });
             return;
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/controllers/CreateProductController.ts:14:76
     }
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-        if(request.body === undefined || typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
-            return;
-        }
+        if(request.body === undefined || typeof request.body !== "object") {}
         const { barcode, name } = request.body as { barcode: string, name: string };
 
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: TypeError: Cannot destructure property 'barcode' of 'request.body' as it is undefined.

[Killed] StringLiteral
src/controllers/CreateProductController.ts:15:45
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
         if(request.body === undefined || typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
+            reply.status(400).send({ error: "" });
             return;
         }
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid request body",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/CreateProductController.ts:15:36
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
         if(request.body === undefined || typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
+            reply.status(400).send({});
             return;
         }
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid request body",
- }

[Killed] ConditionalExpression
src/controllers/CreateProductController.ts:22:13
 
         const result = this.createProductUseCase.execute(barcode, name);
 
-        if (result instanceof InfrastructureError) {
+        if (true) {
             reply.status(500).send({ error: result.message });
             return;
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/controllers/CreateProductController.ts:22:52
 
         const result = this.createProductUseCase.execute(barcode, name);
 
-        if (result instanceof InfrastructureError) {
-            reply.status(500).send({ error: result.message });
-            return;
-        }
+        if (result instanceof InfrastructureError) {}
         
         if (result instanceof Error) {
killedBy: CreateProduct integration tests should return 500 if the connection with the database fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] ConditionalExpression
src/controllers/CreateProductController.ts:27:13
             return;
         }
         
-        if (result instanceof Error) {
+        if (false) {
             reply.status(400).send({ error: result.message });
             return;
killedBy: CreateProduct integration tests should return 400 if product exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
src/controllers/CreateProductController.ts:27:13
             return;
         }
         
-        if (result instanceof Error) {
+        if (true) {
             reply.status(400).send({ error: result.message });
             return;
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
src/controllers/CreateProductController.ts:28:36
         }
         
         if (result instanceof Error) {
-            reply.status(400).send({ error: result.message });
+            reply.status(400).send({});
             return;
         }
killedBy: CreateProduct integration tests should return 400 if product exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Product with the same barcode already exists",
- }
