[Killed] BlockStatement
src/InfrastructureError.ts:2:34
 export class InfrastructureError extends Error {
-    constructor(message: string) {
-        super(message);
-        this.name = "InfrastructureError";
-    }
+    constructor(message: string) {}
 }
killedBy: Testing CreateProductOrderController should return an error 500 if receive an InfrastructureError from usecase
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
