[Killed] BlockStatement
src/controllers/CreateProductOrderController.ts:9:80
     
     private createProductOrderUsecase: CreateProductOrderUsecaseInterface;
 
-    constructor(createProductOrderUsecase: CreateProductOrderUsecaseInterface) {
-        this.createProductOrderUsecase = createProductOrderUsecase;
-    }
+    constructor(createProductOrderUsecase: CreateProductOrderUsecaseInterface) {}
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
killedBy: Testing CreateProductOrderController should create a product order successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'execute')

[Killed] ConditionalExpression
src/controllers/CreateProductOrderController.ts:16:17
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
     
             // Validação do corpo da requisição exigida nos testes
-            if (!request.body) {
+            if (false) {
                 return reply.status(400).send({ error: "Invalid request body" });
             }
killedBy: Testing CreateProductOrderController should return an error 400 if the body is not present
statusReason: TypeError: Cannot destructure property 'barcode' of 'request.body' as it is undefined.

[Killed] ConditionalExpression
src/controllers/CreateProductOrderController.ts:16:17
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
     
             // Validação do corpo da requisição exigida nos testes
-            if (!request.body) {
+            if (true) {
                 return reply.status(400).send({ error: "Invalid request body" });
             }
killedBy: Testing CreateProductOrderController should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/controllers/CreateProductOrderController.ts:26:17
             const result = this.createProductOrderUsecase.execute(barcode, orderQuantity, parsedDate);
 
             // Tratamento de erro de infraestrutura do banco de dados (Status 500)
-            if (result instanceof InfrastructureError) {
+            if (true) {
                 return reply.status(500).send({ error: result.message });
             }
killedBy: Testing CreateProductOrderController should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/controllers/CreateProductOrderController.ts:26:56
             const result = this.createProductOrderUsecase.execute(barcode, orderQuantity, parsedDate);
 
             // Tratamento de erro de infraestrutura do banco de dados (Status 500)
-            if (result instanceof InfrastructureError) {
-                return reply.status(500).send({ error: result.message });
-            }
+            if (result instanceof InfrastructureError) {}
 
             // Tratamento de erros de regra de negócio (Status 400)
killedBy: Testing CreateProductOrderController should return an error 500 if receive an InfrastructureError from usecase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] BlockStatement
src/controllers/CreateProductOrderController.ts:31:42
             }
 
             // Tratamento de erros de regra de negócio (Status 400)
-            if (result instanceof Error) {
-                return reply.status(400).send({ error: result.message });
-            }
+            if (result instanceof Error) {}
 
             // Sucesso na criação do recurso (Status 201)
killedBy: Testing CreateProductOrderController should return an error 400 if receive an Error from usecase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
src/controllers/CreateProductOrderController.ts:31:17
             }
 
             // Tratamento de erros de regra de negócio (Status 400)
-            if (result instanceof Error) {
+            if (true) {
                 return reply.status(400).send({ error: result.message });
             }
killedBy: Testing CreateProductOrderController should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
src/controllers/CreateProductOrderController.ts:32:47
 
             // Tratamento de erros de regra de negócio (Status 400)
             if (result instanceof Error) {
-                return reply.status(400).send({ error: result.message });
+                return reply.status(400).send({});
             }
 
killedBy: Testing CreateProductOrderController should return an error 400 if receive an Error from usecase
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "A quantidade do pedido deve ser maior que zero.",
- }

[Killed] ObjectLiteral
src/controllers/CreateProductOrderController.ts:36:43
             }
 
             // Sucesso na criação do recurso (Status 201)
-            return reply.status(201).send({ 
-                id: result.id,
-                product: result.product,
-                orderQuantity: result.orderQuantity,
-                orderDate: result.orderDate
-            });
+            return reply.status(201).send({});
     }
 }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "id"
Received path: []

Expected value: Any<String>
Received value: {}
