[Killed] BlockStatement
src/entities/Product.ts:6:81
     private name: string;
     private quantityInStock: number;
 
-    private constructor(barcode: string, name: string, quantityInStock: number) {
-        this.barcode = barcode;
-        this.name = name;
-        this.quantityInStock = quantityInStock;
-    }
+    private constructor(barcode: string, name: string, quantityInStock: number) {}
 
     public static create(barcode: string, name: string): Product | Error {
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/entities/Product.ts:12:74
         this.quantityInStock = quantityInStock;
     }
 
-    public static create(barcode: string, name: string): Product | Error {
-        if (!barcode || barcode.trim() === "") {
-            return new Error("Barcode is required");
-        }
-        if (!name || name.trim() === "") {
-            return new Error("Name is required");
-        }
-        const quantityInStock = 0;
-        return new Product(barcode, name, quantityInStock);
-    }
+    public static create(barcode: string, name: string): Product | Error {}
 
     public static rebuild(barcode: string, name: string, quantityInStock: number): Product {
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
src/entities/Product.ts:13:13
     }
 
     public static create(barcode: string, name: string): Product | Error {
-        if (!barcode || barcode.trim() === "") {
+        if (true) {
             return new Error("Barcode is required");
         }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/entities/Product.ts:13:13
     }
 
     public static create(barcode: string, name: string): Product | Error {
-        if (!barcode || barcode.trim() === "") {
+        if (false) {
             return new Error("Barcode is required");
         }
killedBy: testing Product entity should return an error when creating a product with invalid barcode
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: Product

[Killed] StringLiteral
src/entities/Product.ts:14:30
 
     public static create(barcode: string, name: string): Product | Error {
         if (!barcode || barcode.trim() === "") {
-            return new Error("Barcode is required");
+            return new Error("");
         }
         if (!name || name.trim() === "") {
killedBy: testing Product entity should return an error when creating a product with invalid barcode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Barcode is required"
Received: ""

[Killed] ConditionalExpression
src/entities/Product.ts:16:22
         if (!barcode || barcode.trim() === "") {
             return new Error("Barcode is required");
         }
-        if (!name || name.trim() === "") {
+        if (!name || false) {
             return new Error("Name is required");
         }
killedBy: testing Product entity should return an error when creating a product with invalid name
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: Product

[Killed] BlockStatement
src/entities/Product.ts:16:42
         if (!barcode || barcode.trim() === "") {
             return new Error("Barcode is required");
         }
-        if (!name || name.trim() === "") {
-            return new Error("Name is required");
-        }
+        if (!name || name.trim() === "") {}
         const quantityInStock = 0;
         return new Product(barcode, name, quantityInStock);
killedBy: CreateProductUsecase tests should return an Error when the entity returns an error
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: Object

[Killed] BlockStatement
src/entities/Product.ts:23:92
         return new Product(barcode, name, quantityInStock);
     }
 
-    public static rebuild(barcode: string, name: string, quantityInStock: number): Product {
-        return new Product(barcode, name, quantityInStock);
-    }
+    public static rebuild(barcode: string, name: string, quantityInStock: number): Product {}
 
     public getBarcode(): string {
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/entities/Product.ts:27:33
         return new Product(barcode, name, quantityInStock);
     }
 
-    public getBarcode(): string {
-        return this.barcode;
-    }
+    public getBarcode(): string {}
 
     public getName(): string {
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/entities/Product.ts:31:30
         return this.barcode;
     }
 
-    public getName(): string {
-        return this.name;
-    }
+    public getName(): string {}
 
     public getQuantityInStock(): number {
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/entities/Product.ts:35:41
         return this.name;
     }
 
-    public getQuantityInStock(): number {
-        return this.quantityInStock;
-    }
+    public getQuantityInStock(): number {}
 }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
