[Killed] BlockStatement
src/entities/ProductOrder.ts:9:94
     private orderQuantity: number;
     private orderDate: Date;
 
-    private constructor(id: string, product: Product, orderQuantity: number, orderDate: Date){
-        this.id = id;
-        this.product = product;
-        this.orderQuantity = orderQuantity;
-        this.orderDate = orderDate;
-    }
+    private constructor(id: string, product: Product, orderQuantity: number, orderDate: Date){}
 
     public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/entities/ProductOrder.ts:16:105
         this.orderDate = orderDate;
     }
 
-    public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
-        if(orderQuantity <= 0){
-            return new Error("A quantidade do pedido deve ser maior que zero.");
-        }
-
-        if(this.isInteger(orderQuantity) === false){
-            return new Error("A quantidade do pedido deve ser um número inteiro.");
-        }
-
-        if(orderDate > new Date()){
-            return new Error("A data do pedido não pode ser no futuro.");
-        }
-
-        if(!product){
-            return new Error("O produto do pedido é obrigatório.");
-        }
-
-        return new ProductOrder(
-            crypto.randomUUID(),
-            product,
-            orderQuantity,
-            orderDate
-        );
-    }
+    public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{}
 
     private static isInteger(value: number): boolean {
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/entities/ProductOrder.ts:17:31
     }
 
     public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
-        if(orderQuantity <= 0){
-            return new Error("A quantidade do pedido deve ser maior que zero.");
-        }
+        if(orderQuantity <= 0){}
 
         if(this.isInteger(orderQuantity) === false){
killedBy: CreateProductOrderUsecase tests should return an Error when the product order entity returns an error
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: Object

[Killed] EqualityOperator
src/entities/ProductOrder.ts:17:12
     }
 
     public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
-        if(orderQuantity <= 0){
+        if(orderQuantity < 0){
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] EqualityOperator
src/entities/ProductOrder.ts:21:12
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
 
-        if(this.isInteger(orderQuantity) === false){
+        if(this.isInteger(orderQuantity) !== false){
             return new Error("A quantidade do pedido deve ser um número inteiro.");
         }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/entities/ProductOrder.ts:21:52
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
 
-        if(this.isInteger(orderQuantity) === false){
-            return new Error("A quantidade do pedido deve ser um número inteiro.");
-        }
+        if(this.isInteger(orderQuantity) === false){}
 
         if(orderDate > new Date()){
killedBy: testing ProductOrder entity should return error when order quantity is not a valid number
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: ProductOrder

[Survived] StringLiteral
src/entities/ProductOrder.ts:22:30
         }
 
         if(this.isInteger(orderQuantity) === false){
-            return new Error("A quantidade do pedido deve ser um número inteiro.");
+            return new Error("");
         }
 

[Killed] EqualityOperator
src/entities/ProductOrder.ts:25:12
             return new Error("A quantidade do pedido deve ser um número inteiro.");
         }
 
-        if(orderDate > new Date()){
+        if(orderDate >= new Date()){
             return new Error("A data do pedido não pode ser no futuro.");
         }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/entities/ProductOrder.ts:25:12
             return new Error("A quantidade do pedido deve ser um número inteiro.");
         }
 
-        if(orderDate > new Date()){
+        if(false){
             return new Error("A data do pedido não pode ser no futuro.");
         }
killedBy: testing ProductOrder entity should return error when order date is in the future
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: ProductOrder

[Survived] StringLiteral
src/entities/ProductOrder.ts:30:30
         }
 
         if(!product){
-            return new Error("O produto do pedido é obrigatório.");
+            return new Error("");
         }
 

[Killed] BlockStatement
src/entities/ProductOrder.ts:41:54
         );
     }
 
-    private static isInteger(value: number): boolean {
-        return Number.isInteger(value);
-    }
+    private static isInteger(value: number): boolean {}
     
     public getId(): string{
killedBy: testing ProductOrder entity should return error when order quantity is not a valid number
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: ProductOrder

[Killed] BlockStatement
src/entities/ProductOrder.ts:45:27
         return Number.isInteger(value);
     }
     
-    public getId(): string{
-        return this.id;
-    }
+    public getId(): string{}
 
     public getProduct(): Product{
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "id"

Expected value: Any<String>
Received value: undefined

[Killed] BlockStatement
src/entities/ProductOrder.ts:49:33
         return this.id;
     }
 
-    public getProduct(): Product{
-        return this.product;
-    }
+    public getProduct(): Product{}
 
     public getOrderQuantity(): number{
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/entities/ProductOrder.ts:53:38
         return this.product;
     }
 
-    public getOrderQuantity(): number{
-        return this.orderQuantity;
-    }
+    public getOrderQuantity(): number{}
 
     public getOrderDate(): Date {
killedBy: testing ProductOrder entity should create a product order with valid properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
src/entities/ProductOrder.ts:57:33
         return this.orderQuantity;
     }
 
-    public getOrderDate(): Date {
-        return this.orderDate;
-    }
+    public getOrderDate(): Date {}
 
     public formatOrderDate(): string{
killedBy: testing ProductOrder entity should create a product order with valid properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2026-07-14T23:53:56.565Z
Received: undefined

[Killed] BlockStatement
src/entities/ProductOrder.ts:61:37
         return this.orderDate;
     }
 
-    public formatOrderDate(): string{
-        return this.orderDate.toISOString().replace('T', ' ').replace(/\.\d{3}Z$/, 'Z');
-    }
+    public formatOrderDate(): string{}
 }
killedBy: testing ProductOrder entity should format order date correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-01-01 12:00:00Z"
Received: undefined

[Killed] StringLiteral
src/entities/ProductOrder.ts:62:84
     }
 
     public formatOrderDate(): string{
-        return this.orderDate.toISOString().replace('T', ' ').replace(/\.\d{3}Z$/, 'Z');
+        return this.orderDate.toISOString().replace('T', ' ').replace(/\.\d{3}Z$/, "");
     }
 }
killedBy: testing ProductOrder entity should format order date correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-01-01 12:00:00Z"
Received: "2024-01-01 12:00:00"
