[Killed] BlockStatement
src/repositories/SqliteConnection.ts:7:39
 
     private connection: Database.Database;
 
-    constructor(databasePath: string) {
-        this.connection = new Database(databasePath);
-    }
+    constructor(databasePath: string) {}
 
     getConnection(): Database.Database {
killedBy: CreateProduct integration tests should create a product successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'exec')

[Killed] BlockStatement
src/repositories/SqliteConnection.ts:11:40
         this.connection = new Database(databasePath);
     }
 
-    getConnection(): Database.Database {
-        return this.connection;
-    }
+    getConnection(): Database.Database {}
 }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'exec')
