[Killed] BlockStatement
src/usecases/CreateProductOrderUsecase.ts:26:7
     constructor(
         productRepository: ProductRepositoryInterface,
         productOrderRepository: ProductOrderRepositoryInterface
-    ) {
-        this.productRepository = productRepository;
-        this.productOrderRepository = productOrderRepository;
-    }
+    ) {}
 
     execute(barcode: string, orderQuantity: number, orderDate: Date): CreateProductOrderDTO | Error {
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'findByBarcode')

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:33:13
 
     execute(barcode: string, orderQuantity: number, orderDate: Date): CreateProductOrderDTO | Error {
         const product = this.productRepository.findByBarcode(barcode);
-        if (product instanceof InfrastructureError) {
+        if (false) {
             return product;
         }
killedBy: CreateProductOrder integration tests should return 500 if the connection with the database fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:33:13
 
     execute(barcode: string, orderQuantity: number, orderDate: Date): CreateProductOrderDTO | Error {
         const product = this.productRepository.findByBarcode(barcode);
-        if (product instanceof InfrastructureError) {
+        if (true) {
             return product;
         }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "id"

Expected value: Any<String>
Received value: undefined

[Killed] BlockStatement
src/usecases/CreateProductOrderUsecase.ts:36:44
         if (product instanceof InfrastructureError) {
             return product;
         }
-        if (!(product instanceof Product)) {
-            return new Error("Product does not exist");
-        }
+        if (!(product instanceof Product)) {}
 
         const productOrder = ProductOrder.create(product, orderQuantity, orderDate);
killedBy: CreateProductOrderUsecase tests should return an Error when the product does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Product does not exist"
Received: "O produto do pedido é obrigatório."

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:36:13
         if (product instanceof InfrastructureError) {
             return product;
         }
-        if (!(product instanceof Product)) {
+        if (true) {
             return new Error("Product does not exist");
         }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:41:13
         }
 
         const productOrder = ProductOrder.create(product, orderQuantity, orderDate);
-        if (productOrder instanceof Error) {
+        if (true) {
             return productOrder;
         }
killedBy: CreateProductOrderUsecase tests should return an InfrastructureError when creating the product order fails
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InfrastructureError
Received constructor: ProductOrder

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:41:13
         }
 
         const productOrder = ProductOrder.create(product, orderQuantity, orderDate);
-        if (productOrder instanceof Error) {
+        if (false) {
             return productOrder;
         }
killedBy: CreateProductOrderUsecase tests should return an Error when the product order entity returns an error
statusReason: TypeError: productOrder.getId is not a function

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:46:13
         }
 
         const createResult = this.productOrderRepository.create(productOrder);
-        if (createResult instanceof InfrastructureError) {
+        if (false) {
             return createResult;
         }
killedBy: CreateProductOrderUsecase tests should return an InfrastructureError when creating the product order fails
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InfrastructureError
Received constructor: Object

[Killed] BlockStatement
src/usecases/CreateProductOrderUsecase.ts:46:58
         }
 
         const createResult = this.productOrderRepository.create(productOrder);
-        if (createResult instanceof InfrastructureError) {
-            return createResult;
-        }
+        if (createResult instanceof InfrastructureError) {}
 
         return {
killedBy: CreateProductOrderUsecase tests should return an InfrastructureError when creating the product order fails
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InfrastructureError
Received constructor: Object

[Killed] ObjectLiteral
src/usecases/CreateProductOrderUsecase.ts:50:16
             return createResult;
         }
 
-        return {
-            id: productOrder.getId(),
-            product: productOrder.getProduct(),
-            orderQuantity: productOrder.getOrderQuantity(),
-            orderDate: productOrder.getOrderDate()
-        };
+        return {};
     }
 }
killedBy: CreateProductOrderUsecase tests should create a product order successfully when the product exists
statusReason: Error: expect(received).toBeDefined()

Received: undefined
