[Killed] BlockStatement
src/usecases/CreateProductUsecase.ts:19:64
 
     private productRepository: ProductRepositoryInterface;
 
-    constructor(productRepository: ProductRepositoryInterface) {
-        this.productRepository = productRepository;
-    }
+    constructor(productRepository: ProductRepositoryInterface) {}
 
     execute(barcode: string, name: string): CreateProductDTO | Error {
killedBy: CreateProductUsecase tests should create a product successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'findByBarcode')

[Killed] BlockStatement
src/usecases/CreateProductUsecase.ts:23:70
         this.productRepository = productRepository;
     }
 
-    execute(barcode: string, name: string): CreateProductDTO | Error {
-        const result = this.productRepository.findByBarcode(barcode);
-        if (result instanceof InfrastructureError) {
-            return result;
-        }
-        if (result instanceof Product) {
-            return new Error("Product with the same barcode already exists");
-        }
-        const newProduct = Product.create(barcode, name);
-        if (newProduct instanceof Error) {
-            return newProduct;
-        }
-        const createResult = this.productRepository.create(newProduct);
-        if (createResult instanceof InfrastructureError) {
-            return createResult;
-        } else {
-            return {
-                barcode: newProduct.getBarcode(),
-                name: newProduct.getName(),
-                quantityInStock: newProduct.getQuantityInStock()
-            };
-        }
-    }
+    execute(barcode: string, name: string): CreateProductDTO | Error {}
 }
killedBy: CreateProductUsecase tests should create a product successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"barcode": "123456789", "name": "Coca Cola 2L", "quantityInStock": 0}
Received: undefined

[Killed] ConditionalExpression
src/usecases/CreateProductUsecase.ts:25:13
 
     execute(barcode: string, name: string): CreateProductDTO | Error {
         const result = this.productRepository.findByBarcode(barcode);
-        if (result instanceof InfrastructureError) {
+        if (true) {
             return result;
         }
killedBy: CreateProductUsecase tests should create a product successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"barcode": "123456789", "name": "Coca Cola 2L", "quantityInStock": 0}
Received: null

[Survived] BlockStatement
src/usecases/CreateProductUsecase.ts:25:52
 
     execute(barcode: string, name: string): CreateProductDTO | Error {
         const result = this.productRepository.findByBarcode(barcode);
-        if (result instanceof InfrastructureError) {
-            return result;
-        }
+        if (result instanceof InfrastructureError) {}
         if (result instanceof Product) {
             return new Error("Product with the same barcode already exists");

[Killed] ConditionalExpression
src/usecases/CreateProductUsecase.ts:28:13
         if (result instanceof InfrastructureError) {
             return result;
         }
-        if (result instanceof Product) {
+        if (true) {
             return new Error("Product with the same barcode already exists");
         }
killedBy: CreateProductUsecase tests should create a product successfully
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not Error

[Killed] BlockStatement
src/usecases/CreateProductUsecase.ts:28:40
         if (result instanceof InfrastructureError) {
             return result;
         }
-        if (result instanceof Product) {
-            return new Error("Product with the same barcode already exists");
-        }
+        if (result instanceof Product) {}
         const newProduct = Product.create(barcode, name);
         if (newProduct instanceof Error) {
killedBy: CreateProductUsecase tests should return an Error when the product already exists
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error
Received constructor: Object

[Killed] BlockStatement
src/usecases/CreateProductUsecase.ts:32:42
             return new Error("Product with the same barcode already exists");
         }
         const newProduct = Product.create(barcode, name);
-        if (newProduct instanceof Error) {
-            return newProduct;
-        }
+        if (newProduct instanceof Error) {}
         const createResult = this.productRepository.create(newProduct);
         if (createResult instanceof InfrastructureError) {
killedBy: CreateProductUsecase tests should return an Error when the entity returns an error
statusReason: TypeError: newProduct.getBarcode is not a function

[Killed] ConditionalExpression
src/usecases/CreateProductUsecase.ts:32:13
             return new Error("Product with the same barcode already exists");
         }
         const newProduct = Product.create(barcode, name);
-        if (newProduct instanceof Error) {
+        if (false) {
             return newProduct;
         }
killedBy: CreateProductUsecase tests should return an Error when the entity returns an error
statusReason: TypeError: newProduct.getBarcode is not a function

[Killed] ConditionalExpression
src/usecases/CreateProductUsecase.ts:36:13
             return newProduct;
         }
         const createResult = this.productRepository.create(newProduct);
-        if (createResult instanceof InfrastructureError) {
+        if (true) {
             return createResult;
         } else {
killedBy: CreateProduct integration tests should create a product successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'barcode')

[Killed] ConditionalExpression
src/usecases/CreateProductUsecase.ts:36:13
             return newProduct;
         }
         const createResult = this.productRepository.create(newProduct);
-        if (createResult instanceof InfrastructureError) {
+        if (false) {
             return createResult;
         } else {
killedBy: CreateProductUsecase tests should return an InfrastructureError when the method create return an error
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InfrastructureError
Received constructor: Object

[Killed] BlockStatement
src/usecases/CreateProductUsecase.ts:38:16
         const createResult = this.productRepository.create(newProduct);
         if (createResult instanceof InfrastructureError) {
             return createResult;
-        } else {
-            return {
-                barcode: newProduct.getBarcode(),
-                name: newProduct.getName(),
-                quantityInStock: newProduct.getQuantityInStock()
-            };
-        }
+        } else {}
     }
 }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'barcode')
